tap "charmbracelet/tap"
tap "deskflow/tap"
brew "xz"
brew "openssl@3"
brew "awscli"
brew "fastfetch"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "imagemagick"
brew "mas"
brew "maven"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "sox"
brew "starship"
brew "tcl-tk@8"
brew "wget"
brew "yarn"
brew "zlib"
brew "charmbracelet/tap/freeze"
cask "1password"
cask "alfred"
cask "alt-tab"
cask "anki"
cask "appcleaner"
cask "claude"
cask "cleanshot"
cask "codex"
cask "crossover"
cask "cursor"
cask "dash"
cask "deskflow/tap/deskflow"
cask "discord"
cask "displaybuddy"
cask "docker-desktop"
cask "freeze"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "istat-menus"
cask "jump-desktop"
cask "karabiner-elements"
cask "keycastr"
cask "keyclu"
cask "linearmouse"
cask "logi-options+"
cask "maccy"
cask "macs-fan-control"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "middle"
cask "obsidian"
cask "ollama-app"
cask "omnissa-horizon-client"
cask "parallels"
cask "postman"
cask "rectangle"
cask "rubymine"
cask "screen-studio"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vanilla"
cask "visual-studio-code"
cask "windows-app"
cask "zoom"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onelight"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anoff.theme-monokai-light"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "anysphere.remote-ssh"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "extr0py.vscode-relative-line-numbers"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "graphite.gti-vscode"
vscode "humao.rest-client"
vscode "hwencc.html-tag-wrapper"
vscode "icrawl.discord-vscode"
vscode "jorritkeijzer.vscode-dayspring-theme"
vscode "kilocode.kilo-code"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koichisasada.vscode-rdbg"
vscode "leizongmin.node-module-intellisense"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nataliefruitema.modern-purple-theme"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rimuruchan.vscode-fix-checksums-next"
vscode "ritwickdey.liveserver"
vscode "shopify.ruby-lsp"
vscode "stephanvs.dot"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "uloco.theme-bluloco-light"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
npm "@anthropic-ai/claude-code"
npm "corepack"
