[
  "obsidian-style-settings",
  "calendar",
  "obsidian-icon-folder",
  "homepage",
  "recent-files-obsidian",
  "obsidian-completr",
  "url-into-selection",
  "obsidian-text-format",
  "tag-wrangler",
  "settings-search",
  "obsidian-tasks-plugin",
  "cmdr",
  "quickadd",
  "dataview",
  "obsidian-hider",
  "templater-obsidian"
]